<?php

// Supporter rewards translations

return [
    'donate' => 'Δώρισε', //menu item, short
    'supportUs' => 'Στηρίξτε μας', //menu item, short
    'descr' => 'Στήριξτε το Jstris με μία δωρεά και ενεργοποιήστε τις ανταμοιβες των υποστηρικτών', 
    'supportJstris' => 'Στήριξτε το Jstris',
    'supportDesc1' => 'Αν απολαμβάνετε το παιχνίδι, σκετφτείτε τη δωρέα σε αυτό το project για να συνεισφέρετε στην μελλοντική του εξέλιξη και στα έξοδα των servers.',
    'warnDelay' => 'Η συναλλαγή μπορεί να χρειαστεί εώς και 10 λεπτά να φανεί στον λογαριασμό σας στο Jstris. Έπειτα μπορείτε να ρυθμίσετε τα πλεονεκτήματα των υποστηρικτών εδώ.',

    't1Full' => 'Υποστηρικτής Tier 1',
    't2Full' => 'Υποστηρικτής Tier 2',
    't1' => 'Tier 1',
    't2' => 'Tier 2',

    //description of supporter rewards
    'nameIcon' => 'Εικονίδιο ονόματος',
    'nameIconDesc' => 'Επέλεξε 1 από τα 10 εικονίδια (συμπ. τη σημαία της χώρας σου) να εμφανίζεται πριν το όνομα σου.', 
    'emotes' => 'Εικονίδια στη συνομιλία',
    'emotesDesc' => 'Πληκτρολογώντας <code>:</code> στη συνομιλία jstris, ανοίγει η συλλογή των emote με διαθέσιμα 2000+ emotes από την βιβλιοθήκη Openmoji.',
    'discord' => 'Ρόλος στο Jstris discord',
    'discordDesc' => 'Πορτοκαλί όνομα στον σέρβερ Jstris στο Discord. Ενεργοποιείται μόνο με τη συνδέση του λογαριασμόυ Discord στο Jstris.',
    'list' => 'Όνομα στη λίστα των υποστηρικτών',
    'listDesc' => 'Ένας σύνδεσμος με το προφίλ σας στο παιχνίδι θα συμπεριληφθεί στη λίστα των υποστηρικτών. Μπορεί να απενεργοποιηθεί από τις ρυθμίσεις.',

    'customColor' => 'Προσαρμογή χρώματος συνομιλίας',
    'customColorDesc' => 'Μπορείτε να θέσετε όποιο χρώμα επιθυμείτε στο όνομα με το εργαλείο επιλογής χρώματος.',
    'moreIcons' => '2000+ εικονίδια ονόματος',
    'moreIconsDesc' => 'Μπορείτε να θέσετε οποιδήποτε από τα 2000+ εικονίδια emoji από τη βιβλιοθήκη Openmoji ως εικονίδιο πριν το όνομα σας στο παιχνίδι και στην ιστοσελίδα. Μπορείτε να ενεργοποιήσετε τυχαία επιλογή εικονιδίου με τη κάθε φόρτωση του παιχνιδιού.',
    'blockSkins' => '100+ επιπλέον skin τούβλων',
    'blockSkinsDesc' => '100+ επιπλέον skin τούβλων θα είναι διαθέσιμα στη ρύθμιση Εμφάνιση στο παιχνίδι. Η επιλογή skin θα είναι εμφανής σε άλλους παίκτες καθώς και στα replays.',
    'changeName' => 'Επιλογή αλλαγής ψευδωνύμου',
    'changeNameDesc' => 'Επιλογή αλλαγής ψευδωνύμου μία φορά τον μήνα.',
    'allFromT1' => 'και τα πάντα από το Tier 1',

    'perMonth' => ':cost ανά μήνα', //":cost" is replaced with number
    'customAmount' => 'Πρασαρμοσμένο ποσό',
    'customAmountDesc' => 'If you prefer to donate a custom amount, you can configure it here. In case of a one-time donation, the supporter benefits are assigned to your account for a duration based on the amount.',
    'oneTime' => 'Μία φορά', //max. 8chars
    'monthly' => 'Μηνιαία',  //max. 8chars
    'other' => 'Άλλο',  // meaning Other amount than suggested
    'estimate' => 'Εμφάνιση εκτιμώμενης τιμής',
    'dAmount' => 'Ποσότητα δωρεάς',
    'sDuration' => 'Διάρκεια στήριξης',
    'learnMore' => 'Μάθετε περισσότερα', //show more information
    'paymentsInfo' => 'Επεξεργασία με :service_name.&nbsp; Μπορεί να ακυρωθεί ανά πάσα στιγμή στο ταμπλό του λογαριασμού.',

    'gift' => 'Ανταμοιβές Δώρων',
    'giftDesc' => 'Εδώ μπορείτε να δωρίσετε στο όνομα στο όνομα οποιουδήποτε Jstris λογαριασμού. Εισάγετε το ψευδώνυμο στο πλαίσιο κειμένου στα δεξιά και πατήστε Εφαρμογή. Μετά από αυτό, οποιαδήποτε δωρεά θα σταλεί από αυτή τη σελίδα θα ανατεθεί στον επιλεγμένο λογαριασμό.',
    'giftTo' => 'Δώρο σε λογαριασμό',
    'set' => 'Εφαρμογή', //confirm, ok, apply,...

    'rewardsAvailable' => 'Διαθέσιμες ανταμοιβές δωρεάς',
    'rewardsList' => 'Ευχαριστούμε για τη δωρεά σας στο Jstris! Μπορείτε να ενεργοποιήσετε τις ακόλουθες ανταμοιβές.',
    'monthlyActive' => 'Αυτή τη στιγμή έχετε ενεργή την :type συνδρομή.',
    'customActive' => 'Έχετε ενεργές τις :type ανταμοιβές για :days μέρες σύμφωνα με το ποσό της δωρεάς σας.',

    //configuration
    'gift' => 'Ανταμοιβές δώρων',
    'ingameIcon' => 'Εικονίδιο στο παιχνίδι',
    'countryFlag' => 'Σημαία χώρας',
    'iconEmote' => 'Προσαρμοσμένο emote ως εικονίδιο στο παιχνίδι',
    'iconEmoteDesc' => 'Ξεκινήστε να πληκτρολογείτε για αναζήτηση. Επισκεφθείτε το :link για τη πλήρη λίστα των ονομάτων των emote.',
    'randIcon' => 'Επιλέξτε ένα νέο εικονίδιο τυχαία κάθε φορά που φορτώνεται το παιχνίδι',
    'chatColor' => 'Προσαρμοσμένο χρώμα ονόματος στο παιχνίδι',
    'supporterList' => 'Ψευδώνυμο που εμφανίζεται στη λίστα των υποστηρικτών',
    'roleAdded' => 'Προστέθηλε στον συνδεδεμένο Discord λογαριασμό :name.',
    'addDiscord' => 'Προσθήκη του Discord λογαριασμού στο <a href=":link">Jstris account settings</a> πριν την ενεργοποίηση.',
    'apply' => 'Εφαρμογή αλλαγών',
];
