<?php

// Supporter rewards translations

return [
    'donate' => 'Пожертви', //menu item, short
    'supportUs' => 'Підтримайте нас', //menu item, short
    'descr' => 'Підтримати Jstris, надіславши внесок та увімкнувши нагороди підтримувача',
    'supportJstris' => 'Підтримати Jstris',
    'supportDesc1' => 'Якщо ви хочете підтримати цю гру, то розгляньте можливість пожертвування для цього проєкт, щоб допомогти покрити витрати на сервери та подальший розвиток.',
    'warnDelay' => 'Це може зайняти до 10 хвилин до тих пір, поки транзакція не надійде на ваш Jstris акаунт. Потім ви зможете налаштувати нагороди підтримувача тут.',

    't1Full' => 'Supporter Рангу 1',
    't2Full' => 'Supporter Рангу 2',
    't1' => 'Ранг 1',
    't2' => 'Ранг 2',

    //description of supporter rewards
    'nameIcon' => 'Іконка в імені',
    'nameIconDesc' => 'Виберіть один з 10 значків (вкл. прапорцем країни), які будуть показані перед вашим ім\'ям.',
    'emotes' => 'Емодзі в чаті',
    'emotesDesc' => 'Набравши <code>:</code> в jstris чаті, відкриється вибір емодзі з 2000+ доступних смайлів із бібліотеки Openmojy.',
    'discord' => 'Роль в Jstris discord сервері',
    'discordDesc' => 'Помаранчеве ім\'я на сервері Jstris Discord. Застосовується тільки якщо ви прив\'яжете обліковий запис Discord до Jstris.',
    'list' => 'Ім\'я у списку "Підтримка проєкту"',
    'listDesc' => 'Посилання на ваш профіль в грі буде додано до списку прихильників. Може бути відключено в налаштуваннях.',

    'customColor' => 'Власний колір у чаті',
    'customColorDesc' => 'Ви можете вибрати будь-який колір імені, використовуючи інструмент вибору кольорів.',
    'moreIcons' => '2000+ символів в імені',
    'moreIconsDesc' => 'Ви можете задати будь-який з 2000+ емодзі з бібліотеки Openmoji як іконку перед вашим іменем в грі та на сайті. Ви також можете увімкнути вибір випадкових значків при кожному завантаженні гри.',
    'blockSkins' => '100+ теми для фігур',
    'blockSkinsDesc' => '100+ тем для фігур будуть доступні в налаштуваннях зовнішнього вигляду. Ці теми будуть видимий для інших гравців і у ваших повторах.',
    'changeName' => 'Можливість зміни імені користувача',
    'changeNameDesc' => 'Можливість змінити ім\'я користувача раз на місяць.',
    'allFromT1' => 'і все з Рангу 1',

    'perMonth' => ':cost за місяць', //":cost" is replaced with number
    'customAmount' => 'Власна сума',
    'customAmountDesc' => 'Якщо ви віддаєте перевагу пожертвуванню особливої суми, ви можете налаштувати її тут. У разі одноразової пожертви нагородити підтримувача будуть доступні на тривалість в залежності від суми пожертви.',
    'oneTime' => 'Одноразово', //max. 8chars
    'monthly' => 'Щомісяця',  //max. 8chars
    'other' => 'Інше',  // meaning Other amount than suggested
    'estimate' => 'Показати ціну',
    'dAmount' => 'Сума пожертв',
    'sDuration' => 'Тривалість підтримки',
    'learnMore' => 'Детальніше', //show more information
    'paymentsInfo' => 'Обробляється через :service_name.&nbsp; Може бути скасовано в будь-який час на сторінці облікового запису.',

    'gift' => 'Подарувати нагороди',
    'giftDesc' => 'Тут ви можете пожертвувати на ім\'я будь-якого іншого облікового запису Jstris. Введіть ім\'я користувача облікового запису в текстовому полі праворуч і натисніть кнопку Надіслати. Після цього, будь яка пожертва буде прикріплена до вибраного облікового запису.',
    'giftTo' => 'Подарувати',
    'set' => 'ОК', //confirm, ok, apply,...

    'rewardsAvailable' => 'Доступні винагороди за пожертву',
    'rewardsList' => 'Дякуємо за пожертву для Jstris! Ви можете відкрити наступні нагороди.',
    'monthlyActive' => 'Наразі :type підписка активна.',
    'customActive' => 'У вас включені :type нагороди протягом :days на основі суми пожертвування.',

    //configuration
    'gift' => 'Подарувати нагороди',
    'ingameIcon' => 'Іконка в грі',
    'countryFlag' => 'Прапор країни',
    'iconEmote' => 'Власні eмодзі як значок у грі',
    'iconEmoteDesc' => 'Напишіть назву емодзі англійською для пошуку. Перегляньте повний список назв емодзі на сайті :link.',
    'randIcon' => 'Вибрати нову іконку випадковим чином при завантаженні гри',
    'chatColor' => 'Колір імені в грі',
    'supporterList' => 'Ім\'я користувача згадане у списку підтримувачів',
    'roleAdded' => 'Додано до вашого приєднаного облікового запису Discord :name.',
    'addDiscord' => 'Додайте свій обліковий запис Discord до аккаунту <a href=":link">Jstris</a> перед увімкненням.',
    'apply' => 'Застосувати зміни',
];
