<?php

return [
    'donate' => 'حمایت', //menu item, short
    'supportUs' => 'حمایت از ما', //menu item, short
    'descr' => 'Jstris را حمایت کنید و جایزه حامی را دریافت کنید',
    'supportJstris' => 'Jstris را حمایت کنید',
    'supportDesc1' => 'اگر به این بازی علاقه مندید، لطفا نسبت به حمایت از این پروژه اقدام کنید و به تامین هزینه سرور و توسعه بیشتر کمک کنید.',
    'warnDelay' => 'ممکن است تا ۱۰ دقیقه طول بکشد تا پرداخت شما در حساب Jstris شما اعمال شود. سپس شما میتوانید ویژگی های حامی خود را پیکربندی کنید.',

    'benefitsConfig' => 'ویژگی ها در تنظیمات شما قابل پیکربندی است.',
    'txProcessing' => 'فرایند پرداخت در حال انجام است. به زودی قابلیت های حامی در حسابتان موجود میشود',
    'choosePayment' => 'انتخاب روش پرداخت',
    'morePaymentOptions' => 'گزینه های پرداخت بیشتر',

    't1Full' => 'حامی ردیف ۱',
    't2Full' => 'حامی ردیف ۱',
    't1' => 'ردیف ۱',
    't2' => 'ردیف ۲',

    //description of supporter rewards
    'nameIcon' => 'نام آیکن',
    'nameIconDesc' => 'یکی از ۱۰ آیکن (از جمله پرچم کشورتان) را انتخاب کنید تا قبل اسمتان قرار بگیرد',
    'emotes' => 'شکلک های در گفتگو',
    'emotesDesc' => 'با تایپ کردن <code>:</code> در چت jstris، انتخاب کننده شکلک با +۲۰۰۰ شکلک از کتابخانه Openmoji باز میشود.',
    'discord' => 'نقض در دیسکورد Jstris',
    'discordDesc' => 'نام نارنجی در سرورو دیسکورد Jstris. فقط در صورتی که شما حساب دیسکوردتان را به Jstris پیوند داده باشید.',
    'list' => 'نام در فهرست حامیان',
    'listDesc' => 'پیوند به پروفایل بازیتان در فهرست حامیان قرار میگیرد. قابل غیرفعالسازی در تنظیمات.',

    'customColor' => 'رنگ سفارشی در گفتگو',
    'customColorDesc' => 'میتوانید نامتان را به هر رنگی که میخواهید توسط انتخاب کننده رنگ در بیاورید.',
    'moreIcons' => '۲۰۰۰+ آیکن اسم',
    'moreIconsDesc' => 'میتوانید هرکدام از ۲۰۰۰+ آیکن شکلک از کتابخانه openmoji را قبل از اسم خود قرار دهید. همچنین میتوانید انتخاب آیکن تصادفی برای هر بار که وارد بازی میشوید را فعال کنید.',
    'blockSkins' => '۱۰۰+ پوسته مهره ها',
    'blockSkinsDesc' => '۱۰۰+ پوسته مهره های بیشتر در تنظیمات ظاهر شما موجود میشود. این انتخاب پوسته برای بازیکنان دیگر که بازپخش بازی شما را میبینند نیز نمایان است.',
    'changeName' => 'امکان تغییر نام کاربری',
    'changeNameDesc' => 'امکان تغییر نام کاربریتان ماهی یکبار',
    'profileCustomizations' => 'شخصی سازی پروفایل',
    'profileCustomizationsDesc' => 'میتوانید عکس پروفایل شخصی آپلود کنید و از فرمت های اضافه در پیام «درباره من» پروفایلتان (بیش از ۲۰۰۰ حرف، استفاده از فراپیوند و شکلک) استفاده کنید.',
    'saveMatches' => 'ذخیره بازی های مقابل با روبات',
    'saveMatchesDesc' => 'بازیهای 1v1 تان مقابل بات ها در نتایج بازی ذخیره میگردد که شامل بازپخش و آمار پیشرفته است.',
    'unlimitedReplays' => 'بازپخش بینهابت',
    'unlimitedReplaysDesc' => 'هیچکدام از بازپخش های تک نفره تان حذف نمیشود تا وقتی که حامی حسابتان فعال است.',
    'allFromT1' => 'همه چیز از ردیف ۱',

    'perMonth' => ':cost در ماه', //":cost" is replaced with number
    'customAmount' => 'مقدار سفارشی',
    'customAmountDesc' => 'شما میتوانید بک پرداخت یک زمانه حامی شوید و یا با مقدار سفارشی. در صورت پرداخت یک زمانه، ویژگی های حامی شما تا مدت خاصی بسته به مقدار پرداخت باقی میماند.',
    'oneTime' => 'تک زمانه', //max. 8chars
    'monthly' => 'ماهانه',  //max. 8chars
    'other' => 'سایر',  // meaning Other amount than suggested
    'estimate' => 'نمایش باقیمانده',
    'dAmount' => 'میزان حمایت',
    'sDuration' => 'مدت حمایت',
    'learnMore' => 'بیشتر بدانید', //show more information
    'paymentsInfo' => 'پردازش توسط :service_name.&nbsp; میتواند هر لحظه در داشبورد حساب لغو شود.',

    'gift' => 'پاداش هدیه',
    'giftDesc' => 'شما میتوانید هدیه ارسال کنید با یک پرداخت با مقدار دلخواه. هدیه ب مقدار مربوطه حامی Jstris به روز تبدیل میشود، که قابل اهدا به هر بازیکنی در Jstris است.',
    'addGiftingBalance' => 'اضافه کردن به معادل هدیه',
    'giftingBalance' => 'معادل هدیه',
    'giftTo' => 'هدیه به حساب',
    'set' => 'ثبت', //confirm, ok, apply,...

    'rewardsAvailable' => 'جایزه حامی موجود است',
    'rewardsList' => 'سپاس بابت حمایت از Jstris! شما میتوانید این جوایز زیر را فعال کنید.',
    'monthlyActive' => 'شما اکنون :type عضویت فعال دارید',
    'customActive' => 'شما این :type جوایز را برای :days روز فعال دارید بسته به مقدار حمایت.',

    //configuration
    'gift' => 'پاداش جایزه',
    'ingameIcon' => 'آیکن داخل بازی',
    'countryFlag' => 'پرچم کشور',
    'iconEmote' => 'شکلک سفارشی به عنوان آیکن داخل بازی',
    'iconEmoteDesc' => 'برای جستجو تایپ کنید. برای دیدن فهرست کامل شکلک ها به :link مراجعه کنید.',
    'randIcon' => 'انتخاب آیکن تصادفی برای هر دفعه که بازی اجرا میشود',
    'chatColor' => 'رنگ نام سفارشی داخل بازی',
    'supporterList' => 'نام کاربری در فهرست حامیان نشان داده شود',
    'roleAdded' => 'به حساب دیسکورد متصل شده شما :name اضافه شد.',
    'addDiscord' => 'قبل از فعالسازی حساب دیسکورد خود را به <a href=":link">تنظیمات حساب Jstris</a> اضافه کنید.',
    'apply' => 'اعمال تغییرات',
];
